[
  "Dark chocolate, raisin, cherry cola",
  "It has a bright acidity balanced with a medium body, milk chocolate and toasted nut flavors, and a deep lingering finish.",
  "Rio Negro coffee has a nice velvety body, mild acidity, and flavors of graham cracker and chocolate.",
  "Chocolate aroma, gentle silky body, malic acidity, brown sugar sweetness",
  "Almond aroma, intense honey sweetness and caramel notes, citric acidity, creamy body",
  "Brilliant acidity, elegantly balanced, flavors of maple syrup and fresh squeezed orange juice. It is impeccably balanced with a long satisfying finish.",
  "Full bodied and rich, milk chocolate and nut flavors with sweet citrus notes",
  "This coffee is clean and sweet, with a softened acidity and medium body. Flavors of cocoa and caramel mingle with hints of tropical fruit.",
  "Balanced and elegant, crisp black tea, citrus, and silky dark chocolate flavors",
  "The cup has medium body, slightly snappy acidity, and is clean and sweet with rich notes of pipe tobacco and cedar, with subtle hints of sandalwood.",
  "Caramel and tart cherry, lemon and intense acidity.",
  "Big body, tobacco, cigar paper, nice intensity and sweetness",
  "Peanut.",
  "Lemon, chocolate, toffee and floral.",
  "Raspberry, perfumed floral, winey berry and chocolate.",
  "Winey fruit, cherry and chocolate.",
  "Caramel, raspberry, floral, peach, red grape, cocoa and creamy.",
  "Sweet, citric, herbal and toffee.",
  "Sweet, full body, light acidity, fruity aftertaste, clean, chocolate notes, balanced",
  "Strong creamy body, light acidity, extremely sweet, hints of fruit, creamy cocoa, Brazil nut finish",
  "Honey crisp apple, red grape and juicy sweet tropical fruit, super sweet",
  "Delicate and sweet. Tons of clarity and beauty, green grape and red apple , cane sugar and pineapple",
  "Cacao powderand fudge, grapes and apples and stone fruit balanced and sweet",
  "Citrusy flavor, medium-bodied, and rich acidity with a clean and sweet aftertaste",
  "Full body, milk chocolate, anise, spice, pleasant berry.",
  "This cup has well balanced acidity with a rich body. It starts off sweet and creamy with notes of tart fruit, and finishes with a bittersweet, dark cocoa note.",
  "Robust, cedar, ginger, syrupy body, spicy Mexican chocolate",
  "This cup has well balanced acidity with a delicate body. It starts off sweet and with slight notes of tart fruit, and finishes with a bittersweet, dark cocoa note.",
  "Strong cedar notes, consistent, balanced, sweet tobacco, winey, spicy, chocolate",
  "Nut and graham.",
  "Sugar and melon with tart acidity and a heavy mouthfeel.",
  "Chocolate, nouget, caramel, well balanced",
  "Jasmine in break, round body, swiss chocolate, pineapple.",
  "Sweet, lemon-lime, cane juice, green grape and tangy.",
  "Sugar Cane juice, lemon and grapefruit.",
  "Caramel, sweet grapefruit, raisin, lime and sugary.",
  "Cane juice, green grape, lime and raisin with tangy acidity.",
  "Citric acidity with sweet grass and nut flavors.",
  "Caramel pecan and lemongrass.",
  "Sugar cane juice, lemon and creamy with citric and tartaric acidity.",
  "excellent acidity, light fruit with citric notes, very smooth, superb creamy mouthfeel, chocolate, plum, grapes, orange, complex",
  "pungent stone fruit notes, winey acidity, juicy, dark chocolate and spice",
  "savory, pleasant citrus notes, milk chocolate, tea leaves, balanced, smooth soft body, delicate clean finish, smooth, tea like, sweet, floral, lemony, bright acidity",
  "nice sweetness, clean, complex, cinnamon notes, good body, chocolate notes, nice nutty notes, tobacco, grape, tangerine, balanced, great aftertaste",
  "Soft with perfumed floral, chocolate, lime and orange candy flavors.",
  "Dried fruit, plums, blackberry, round body, juicy finish.",
  "Toffee and pine with citric acidity.",
  "Tart orange, peach and white grape with a creamy mouthfeel and sweet chocolate aftertaste.",
  "Clean, lilac and cane sugar aroma, creamy body, strawberry notes, pointed acidity, pleasant aftertaste",
  "Floral aromatics with a creamy mouthfeel, tart orange flavor and sweet chocolate aftertaste.",
  "Chocolatey, sweet vanilla aroma, citric notes, smooth body, floral finish.",
  "Nice sweetness, clean, fresh, raspberry, melon",
  "bright acidity, caramel, sweet, milk chocolate, toasted almonds, citrus notes, very balanced, buttery body, winey, nutty notes, pleasant aftertaste",
  "floral, sweet, chocolate notes, winey, soft nutty notes, full body, crisp acidity, complex, hint of fruit in the aftertaste",
  "Chocolate, lemon- lime, thick and balanced.",
  "Lemon and mint with a nutty aftertaste.",
  "Caramel fruit, raisin, tomato and basil with tart acidity.",
  "Coffee cherry, melon, soft and tangy.",
  "bright acidity, creamy body, pleasant aftertaste",
  "Toffee, melon and tart citric.",
  "Toffee and pecan with citric acidity.",
  "spicy, earthy, smoky, tobacco notes, wood notes, medium body, medium acidity",
  "Tart lemon and lime with a creamy mouthfeel and raisiny aftertaste.",
  "Deep dark chocolate, Fudge and toffee, green grape, hazelnut and nutella, apple sweetness, brown sugar and touch of sweet tobacco",
  "Caramel, sweet lemon, orange, raisin and herbaceous with tart acidity.",
  "sweet, almond, light honey, peach nectar, tea-like, chocolate, delicate, soft",
  "Peanut, citric.",
  "Mild, nut and citric.",
  "Caramel, burnt sugar, floral, herbal and citric.",
  "Dark chocolate.",
  "Sweet and balanced with apple, lemon, lime and chocolate.",
  "clean,  lively winey acidity, medium body, chocolate, almonds, citrus notes",
  "Toffee, lemon-lime, almond and savory floral.",
  "Winey with chocolate and tart lemon.",
  "Tropical, chocolate and caramel with citric acidity and a heavy mouthfeel.",
  "Caramel, raisin, sweet cedar, cocoa and sugary with tart citric acidity.",
  "Jasmine, apricot, grape fruit, caramel and tomato.",
  "Sweet and creamy with floral, toffee and tart flavor.",
  "Vanilla, toffee, lemon- lime and sugary.",
  "Chocolate and butter with a sweet, nutty aftertaste.",
  "Toffee, caramel, fruit and berry with winey acidity.",
  "Sweet and clean with toffee, lemon and raisin.",
  "Full body, sweet aroma, low acidity, cherry notes, chocolate, sweet tobacco, clean and pleasant aftertaste.",
  "Toffee, lime, creamy and tart citric acidity.",
  "Tart, toffee, fruit and caramel.",
  "Caramel, fruit, toffee, balanced and savory.",
  "Creamy and sweet with clean coffee cherry, honey and savory fruit.",
  "chocolate, berry, clean, consistent, buttery, creamy, sweet aftertaste, great complexity",
  "Heavy, soy nut and citric.",
  "Tart, sweet, creamy and balanced with cherry cola and chocolate.",
  "Smooth with chamomile, lemon, lime and melon.",
  "Bright, ruby red grapefruit, mulled apricot, gripping acidity",
  "Savory Chocolate, Grass, Nutmeg and Squash.",
  "Green tea, jasmine, apricot, pink jelly bean",
  "Bright, green melon, sweet, lots of tobacco, grapefruit, long finish",
  "Mild chocolate with a smooth mouthfeel and tart citric acidity.",
  "Chocolate, cherry and sugary with winey acidity and a heavy mouthfeel.",
  "Raspberry, cherry, nice intensity, long finish",
  "Soft, lemon and nut.",
  "Green pepper, lemon and citric.",
  "Sweet and creamy with caramel, lime, savory floral and tart acidity.",
  "Sugary, caramel, apple, lemon-lime and savory.",
  "Balanced and sweet with toffee, floral, tart lemon and a creamy mouthfeel.",
  "Sweet, jammy and clean with floral, very fruity and very winey flavors.",
  "Nut, lemon and herb.",
  "Chocolate, vegetal, heavy and lemongrass.",
  "Brown Sugar, Orange, Vanilla, Dark Chocolate, Roasted Almond",
  "Citric, berry.",
  "Tomato, chocolate and lemon with complex acidity.",
  "Chocolate, savory fruit, cherry, lemon-lime and sparkling acidity.",
  "Brown sugar and chocolate, lime acidity and a tangy buttermilk aftertaste.",
  "La Magnolia starts with a recognizably sweet and floral aroma, and has clean acidity, medium body and intense yet delicate flavors of citrus, maple, and honeysuckle.",
  "Tart lemon and lime with a sweet chocolate and cinnamon aftertaste.",
  "Malic and citric acids with a sweet almond aftertaste.",
  "Tart, winey fruit, caramel, honey, lemon and chocolate.",
  "Smooth and citric with chocolate and pulpy fruit.",
  "Caramel, red grapefruit, savory fruit, tomato, burnt sugar, tart and smooth.",
  "Floral aroma with toffee, nutty and herbal flavors and citric acidity.",
  "Creamy, lemon, sugar cane and graham.",
  "Toffee, lemon, sweet and clean.",
  "Toffee, pecan and savory.",
  "Citric and graham.",
  "Caramel aroma, cedar and herbal.",
  "Peanut and citric.",
  "The end result is a blend that is balanced and sweet, with fresh noticeable acidity, flavor nuances of clean berries and fruits, and a thick creamy body. B56 shines in espresso preparation; it exhibits a flavor balance between punchy fruit and chewy nut, produces great crema, and has super long, lingering sweetness.",
  "La Flor del Café is a classic Antigua—it has lively acidity, a heavy body, and flavors of fine chocolate, caramel, and smoky rum.",
  "It is exceptionally clean with a massive syrupy body, pleasing acidity, and flavors of cedar, leather, and a distinct essence of butterscotch.",
  "Caramel, green grape and savory fruit with intense winey acidity.",
  "Grapefruit, grenadine, tropical fruit, fresh tobacco",
  "It is heavy-bodied with mellow acidity and flavors of fresh earth, leather, peat moss, and herbal nuances.",
  "Beautiful fresh acidity for Sumatra, loads of sweet and rich tobacco flavor, leather and clean cedar notes, and a long lingering finish.",
  "Caramel, apple, pear, long finish",
  "Herbal, clean, tangy and heavy.",
  "Thick and citric.",
  "Available on arrival",
  "Nice body, dried apricot, cherry cola, fig",
  "Bright. black & blue fruits, sweet, chocolate cake",
  "Well balanced, apricot, manderin orange, lemon/lime",
  "Lemon and graham.",
  "Bright, sweet, crisp, toffee, apple hard candy",
  "Toffee, peach, apricot",
  "Lemon and nut.",
  "Nutty, lemon and herbal.",
  "Toffee, smooth and savory.",
  "Simple, citric and savory.",
  "Fruity, floral, berry, cherry and caramel with sparkling acidity.",
  "Grapefruit and lemon soda with lively acidity and a tart aftertaste.",
  "Toffee, almond, lemon.",
  "Manderin orange, apricot, dark chocolate",
  "soft nutty notes, dark chocolate, sweet, medium acidity",
  "Sweet, floral, mellow, almond and grape.",
  "Sweet with apple, floral, lemon-lime and grape.",
  "Nutty, thick and citric.",
  "Nutty, cocoa and citric.",
  "Peanut butter and citric.",
  "Herbaceous, nutty and toffee.",
  "Toffee, lemon and herbal.",
  "Sweet herb, lemon, chocolate and tart cherry.",
  "Sweet and tart with chocolate and toffee.",
  "Sweet grapefruit, lemon-lime and fruit punch with citric, tartaric acidity and a heavy mouthfeel.",
  "Well-rounded acidity, pleasant sweetness, good complexity, soft nutty characteristics, chocolate notes",
  "Caramel, toffee, lemon and nut.",
  "Notes of dark cocoa &amp; caramel, medium body and bright citrus acidity.",
  "Chocolate, lemon, tomato and herb.",
  "Chocolate, lime, floral and sweet herb.",
  "Delicate and clean with berry, jasmine, cane juice, grape and cocoa.",
  "Floral, toffee, sugar and lemon.",
  "Fruity and floral with lemon-lime, berry, caramel and lemonade.",
  "Lemon, berry, chocolate",
  "Chocolate, berry",
  "Red grape, blackcurrant, chocolate",
  "Blackberry, raspberry",
  "Orange, milk chocolate, cane sugar",
  "Nutty, sweet, caramel, nice body",
  "Berries, chocolate, grapefruit, silky",
  "Light sweetness, cinnamon, chocolate",
  "Chocolate, fruit, fruity, lemon",
  "Cherry, peach, caramel, chocolate",
  "Sweet, almonds, chocolate, dates, raisins, balanced",
  "Lemon, ruby grapefruit, currant cane sugar.",
  "Vanilla, black tea, cherry, mango",
  "Strawberry, raspberry, dried apricot, fruity",
  "Blossom, floral, raspberry, lemon",
  "Lime, peach, crisp juicy deep",
  "Jasmine, Bergamot, Lemon, Sweet",
  "Bergamot, lime, jasmine, candy",
  "Cherry, bourbon, lemon, chocolate, hops",
  "Floral, black tea, bergamot, blackberries",
  "Apple, raisin, orange, cream, sweet",
  "Chocolate, cherry, caramel, nice acidity",
  "Lemon, Lime, Sweet, Good Dept, Chocolate",
  "intense Chocolate Rich Dry",
  "Floral, blueberry, lime, complex",
  "Floral, apricot, currant, lemon, black tea",
  "Grape, lime, dark chocolate, panela",
  "Lemon, stone fruit, jasmine",
  "Floral, lemon, vanilla, caramel",
  "Cherry, syrup, dark chocolate",
  "Apple, cherry, crisp, caramel",
  "Honeysuckle, graham cracker, cherry",
  "Buttery, stonefruits, berries, sweet, greenish",
  "Caramel, dark chocolate, macadamia",
  "Maple syrup, sugar cane, hibiscus",
  "Fruit punch, milk chocolate, delicate body",
  "Floral, honey, silky",
  "Cherry, grape, caramel",
  "Vanilla, maple syrup, hibiscus",
  "Blackberry, caramel, vanilla",
  "Floral, lemon, raspberry, hibiscus",
  "Balanced, strawberry, pinneapple",
  "Floral, caramel, vanilla, great balance",
  "Nice depth, cherry, tomato",
  "Stonefruit, mango, juicy body, vanilla.",
  "Lemonade, sugar cane, milk chocolate",
  "Toffee, malt, fruit punch, balanced",
  "Cherry cola, berry, green tea, honey and savory.",
  "Syrup, milk chocolate, malt, fruit punch",
  "Cocoa and soy nut.",
  "Dark chocolate, nice body, raisin",
  "Peach, Yasmin, Bergamot, Lemon, Floral, Tea",
  "Hops, lemon, rose hips",
  "Pulpy, chocolate and citric.",
  "Rich and savory fruit, kiwi, raisin and cane juice with citric and tartaric acidity.",
  "Juicy acidity, fresh earth, full body, notes of port wine, tobacco, cedar",
  "Tropical fruit, tomato, and cola with a creamy mouthfeel.",
  "clean, consistent, some nice rustic notes, bright acidity, earthy, floral, soft tobacco, spice",
  "Sweet with caramel, grape, toffee, floral and intense tartaric citric acidity.",
  "Toffee, caramel, fruit, floral and tart green grape.",
  "nice tart notes; soft, light spice; fresh earth, berries and chocolate, clean, consistent, sweet aftertaste",
  "Mild, sweet and clean with citric acidity and a chocolate aftertaste.",
  "Creamy and tart with peach, caramel, chocolate, chamomile and white grape.",
  "Toffee, caramel, chocolate and lime.",
  "Grape, clove, apple and black tea.",
  "savory flavors with citric acidity.",
  "Savory, sugary and syrupy with floral and lemon; malic and tartaric acidity.",
  "Tart cherry, lemon, savory and citric.",
  "bright sweet notes, medium body, balanced, clean/consistent, soft, hint of chocolate",
  "Plum, chocolate, caramel, apple and cherry.",
  "Lime and chocolate with a heavy mouthfeel.",
  "Wildflower honey, blackberry, citrus notes, syrupy body, currant",
  "Lemon balm, toffee, chocolate and almond.",
  "Sweet fruit , rich, smooth, clean, crisp, complex, juicy, cocoa.",
  "Lemon and toffee.",
  "Nutty, citric and heavy.",
  "citric and cocoa.",
  "Colombia Pitalito is recognized for having high acidity, medium to good body, and stone fruit notes.",
  "Floral and peanut.",
  "Candied lime, almond, vanilla, orange.",
  "Sweet with candied nuts, golden raisin and chocolate.",
  "Tart and creamy with floral, chocolate, lime peel and citrus fruits.",
  "Mild, sweet and clean with lemon and fresh herbal flavors.",
  "Balanced with caramel, grape, raisin and lemon-lime.",
  "Chocolate, berry, sweet grapefruit, clean and tart acidity.",
  "Full body, delicate florals, sweet apricot and wildflower honey",
  "Toffee, nutty and citric.",
  "Clean, bright orange acidity with creamy body and pleasant minerals on finish.",
  " Orange dreamsicle; creamy body, nice citrus, sugars and overall balance",
  "clean, bright, complex, full body, sweet, caramel, chocolate, grapes, woody, tobacco",
  "Cherry, green grape and sugary with intense acidity and a creamy mouthfeel.",
  "Classic Boquete profile: pointed and sparkling acidity, tobacco notes on finish, complex, winey, tart, melon, soft earthy note, caramel",
  "Toffee, lemon, chocolate and smooth.",
  "Peach, chocolate, brown sugar, savory and almond.",
  "Chocolate, green grape, savory floral and pulpy jam with winey acidity.",
  "Boozy berry, passion fruit, caramel, floral, grapefruit and limeade.",
  "Sugary fruit and jam, raspberry, lime, apple and tart.",
  "Clean and tart with grape, melon, mango and winey acidity.",
  "Clean, coffee cherry, berry, chocolate and nutty.",
  "Smooth, sweet and clean with caramel, lemon and grape.",
  "Fruity, sugary and tart with berry, lime and lemon balm.",
  "Caramel, lemon, lime, floral and creamy.",
  "Peanut butter, lavender, lemon and chocolate.",
  "Chocolate, cherry, savory and tart.",
  "Grapefruit, lime, toffee, sweet almond and balanced.",
  "Rich sugar, tomato, melon, white grape and savory with lively acidity.",
  "Melon, toffee, lemon and honey peanut butter.",
  "Sweet lemon and soft floral flavors with a sugary mouthfeel.",
  "Lemon-lime, chocolate and caramel with tart acidity and a smooth mouthfeel.",
  "Green pepper, cider vinegar and sweet cedar with citric acidity.",
  "Heavy and citric with toffee and sweet cedar.",
  "Citric and heavy with toffee, clean herb and chocolate.",
  "black tea notes, chocolate notes, blackberry notes, kiwi notes, lemony acidity, sweet, balanced, complex",
  "The Matari lot requires de-gassing and changes significantly five days after roasting. The difference in the cup after de-gassing cannot be overemphasized.",
  "Burnt sugar, honey, black berry and candied lime with intense citric, tartaric and phosphoric acidity and a syrupy mouthfeel.",
  "Juicy green grape and citrus flavors with a soft, sweet aftertaste.",
  "Mild, sweet and clean with lemon and grapefruit flavors.",
  "Caramel and floral flavors with sugary lemon acidity.",
  "Sweet, peach, apricot, long finish",
  "Complex and elegant with raw sugar, honey, currant, blood orange and a floral finish.",
  "Complex, rich and balanced with sugarcane, pink grapefruit and candied fruits.",
  "Soft and bright with floral, berry, lime leaf, brown sugar, pineapple, blackberry cordial and caramel.",
  "Heavy with rhubarb jam, vanilla bean, blood orange and candied lime.",
  "Stewed fruits, red currant and herbaceous.",
  "Sugary with rhubarb jam and apple.",
  "Chocolate, sweet aroma, citrus tones, honeyed, bright medium acidity, well rounded cup.",
  "Rich and intense with plum, candied orange, black tea, raspberry and pomegranate.",
  "Intense fruity aroma with winey berry, green grape, chocolate, savory and floral flavors and a creamy mouthfeel.",
  "Creamy, sweet and savory with caramel fruit, floral, honey and apple.",
  "Sweet winey fruit, lemon, raspberry and clean.",
  "Sweet and tart with chocolate, fruit, citric and tartaric acidity.",
  "Bright, lemon, lime, sweet finish",
  "Bright, complex acidity, tangerine, dark chocolate",
  "Bright, orange, grapefruit, peach",
  "Lime, dark chocolate, cranberry",
  "Toffee, walnut and citric.",
  "Citric with lemon-lime, chocolate, orange and dill.",
  "Complex with cherry, raisin, herbal and citrus.",
  "Tart lemon with a heavy mouthfeel and sweet aftertaste.",
  "Tart lemon and perfumed florals, with a creamy mouthfeel and sweet chocolate aftertaste.",
  "Toffee, lemon, tart, tangy and creamy.",
  "Fruit and nut, chocolate, soft and winey.",
  "Sweet and creamy with toffee and lemon.",
  "Savory, sunflower seed, lemon and citric.",
  "Nutty, lemon and savory.",
  "Chocolate, berry and savory with winey dry acidity.",
  "Savory floral, smooth, toffee, balanced and tart.",
  "Intense ripe fruit, caramel, strawberry and limeade with citric and malic acidity and a thick mouthfeel.",
  "Cane juice, tropical fruit, caramel, currant and grapefruit with intense sparkling acidity.",
  "Rich burnt sugar, ruby red grapefruit, savory fruit, floral, tomato and intense acidity.",
  "Melon, tomato, tropical fruit, brown sugar, green grape and floral.",
  "Grapefruit, caramel, chocolate and savory with intense acidity.",
  "Lemon, soft and nutty.",
  "Chocolate, brown sugar, grapefruit and lemon with citric and tartaric acidity.",
  "Tart with toffee. chocolate, lime and floral.",
  "Sweet, clean, fruity, toffee, honey and creamy.",
  "Honey, lime, floral and sugary.",
  "Citric and savory.",
  "Exceptionally clean, fresh, coriander, cranberry, high acid, complex floral",
  "Floral, chocolate, lemon-lime and almond with tart acidity.",
  "Fruity, molasses",
  "Sweet grapefruit, plum, pith and savory fruits.",
  "Nut and tart citric.",
  "Chocolate, lemon and almond.",
  "Soy nut, thick and citric.",
  "Sweet, toffee, chocolate and baking spices.",
  "Sweet, lemon, toffee, chocolate, savory and tangy.",
  "Cedar and herbal.",
  "Grapefruit, cherry and savory with tart citric and tartaric acidity.",
  "Winey berry, apple, cane juice, cherry, cocoa, creamy and citric.",
  "Blushy and winey fruit, cherry cordial, oaked red wine, rich, sweet and lively.",
  "Creamy, sweet, balanced and delicate with berry, coffee, cherry and florals.",
  "Lemon, cherry, berry and chocolate with winey acidity and a smooth mouthfeel.",
  "Chocolate, nut and tart.",
  "Toffee, nutty and herbal.",
  "Tart with cherry, nut and chocolate.",
  "Sweet lemon, nutty and chocolate.",
  "Thick, citric and peanut butter.",
  "Rich, tomato, savory fruit, caramel, brown sugar and floral with intense sparkling acidity.",
  "Soft, citric, chocolate and fruit.",
  "Tangy citric and tartaric acidity with lemon, chocolate and floral flavor.",
  "Lemon and cocoa with a heavy mouthfeel.",
  "Cedar and nut.",
  "Toffee and lemon tea, tart citric acid and a graham aftertaste.",
  "Toffee, almond and floral with citric acidity.",
  "Coffee cherry, trail mix, toffee and sweet lemon.",
  "Intense chocolate, cinnamon and plum flavors with citric and malic acidity and a sweet, savory aftertaste.",
  "Sweet and heavy with lemon and grapefruit.",
  "Lemon, nutty and cashew.",
  "Nut and sour lemon.",
  "Clean, berry, chocolate, white sugar and citric.",
  "Chocolatey and nutty with citric acidity and an herbal aftertaste.",
  "Dark chocolate, wine, red fruit, floral",
  "Red fruits, floral, chocolate, creamy body",
  "Sugar cane, orange peel, floral, toffee",
  "Vanilla, floral, sugar cane, lime",
  "Chocolate, fruits, orange peel, floral",
  "Dried fruit aroma, with almond notes, silky body, very well rounded/ balance and uniformity",
  "Chocolate aroma, toffee notes, orange citric acidity, creamy body and sweet presence",
  "Chocolate fragance, honey sweetness, silky body and great red wine acidity",
  "Balanced, bright, caramel, clean, dark chocolate, fruit, juicy",
  "Caramel, clean, fresh, fruit, lingering, molasses, nectarine, sugar cane, walnut",
  "Creamy with caramel, tart lime, honey, toffee, and herb.",
  "Big fruit, winey acidity and a creamy mouthfeel with strawberry, chocolate and raisin.",
  "Sweet and clean with caramel, cherry, green grape and citrus fruits.",
  "Black berry, green grape, honey, lemon and sour cherry.",
  "Toasted almond, savory, soft and tart.",
  "Toffee, savory, lemon and nut.",
  "Toffee, nutty and lemon-lime.",
  "Tart citric, nut, chocolate, clean coffee cherry and sweet herb.",
  "Sugary and balanced with caramel, chocolate, red grape, tomato and lemon- lime.",
  "Juicy sweetness with burnt sugar, cherry, honey, floral and citric.",
  "Creamy and sugary with burnt sugar and citrus fruits; intense citric and tartaric acidity.",
  "Citric and salted nuts.",
  "Toffee and burnt sugar with lemon acidity and a smooth mouthfeel.",
  "Sugar, lemon, cashew, heavy and tart.",
  "Brown sugar, lemon, creamy and vegetal.",
  "Toffee, nut brittle and savory herbs with tart citric acidity.",
  "Sweet brown sugar, raisin and citrus. Balanced and creamy.",
  "Citrus, hazlenut, fruity, and bright.",
  "Raisin, golden syrup, spice.",
  "Peanut, lemon and herb with citric acidity.",
  "Chocolate, lemon and herb.",
  "Sweet chocolate, rich body, clean stonefruit notes, consistent &amp; well structured",
  "Caramel, toffee, fruit and creamy.",
  "Sweet, toffee, lime, lemon and tangy.",
  "Toffee, lemon, herb and nut.",
  "Peanut butter, chocolate and citric.",
  "Soy nut and salty.",
  "Nutty and herbal lemon.",
  "A complex cup with notes of jasmine, orange blossom, hibiscus, bergamot, deep citrus and stone fruit.",
  "Apple cider, honey, dense, complex.",
  "Savory, chocolate, burnt sugar and floral with intense acidity.",
  "Tangy buttermilk and honey flavors and a mild, nutty aftertaste.",
  "Grapefruit, tomato and herb with citric acidity.",
  "Sweet, floral, green grape and savory fruit with tart tartaric and citric acidity.",
  "Caramel, fruit, floral, lemongrass and raisin.",
  "Sweet and savory with caramel, grapefruit, tangy acidity and a creamy mouthfeel.",
  "Toffee, cocoa, lemon and mild.",
  "Jasmine, lemon and lime with caramel sweetness and a creamy mouthfeel.",
  "bright & crisp, honey crisp apple, hint papaya, honey almond pie, balanced & Sweet",
  "Creamy, clean and tart with caramel, floral and lemon- lime.",
  "Sweet and bright fruit, balanced and layered, yellow apple and stone fruit, long sweet finish",
  "Our Cascada Estate has strong chocolate notes, a bright and fine acidity with orange and lemon notes. It offers an exquisite roundness and pleasant mouth feel, which can satisfy the most demanding palates.",
  "Chocolate and berry with citric acidity.",
  "Heavy, cocoa and nut.",
  "Sweet winey dark chocolate cherry and almondine, frosting & cake, grape and apple pie",
  "Big body, lots of dark chocolate and fudge, brown sugar, black grape, toffee",
  "sweet acidity, citrus notes, pleasant fruity notes, strawberry and plum, solid body, balanced, chocolate, complex, clean and nice aftertaste",
  "Tangy lemon and toffee with a mild nutty aftertaste.",
  "Sugary with raisin, lime, clove and chocolate with tart citric acidity.",
  "Lemon and peanut.",
  "Fruit and floral, caramel, lemon, honey and clean.",
  "Green grape apple, cacao, lots of honey almond, milk chocolate creamy a little citrus height",
  "Lemon and cedar.",
  "Sweet green grape, red fruits and savory.",
  "Chocolate, toffee, lemon and nutty.",
  "Toffee, herbal and lemon.",
  "Caramel and cashew with winey citric acidity.",
  "Creamy with burnt sugar and citrus fruits; citric and tartaric acidity.",
  "Sugar cane juice, grape, plum, floral and creamy with tart citric and tartaric acidity.",
  "Chocolate, grapefruit, toffee and citric.",
  "Simple, toffee, sweet lemon and herbal.",
  "Smooth and citric with toffee.",
  "Nutty.",
  "juicy sweet & balanced, hint citrus, stone fruit & grape acidity, sweetness & middle body, hint apricot",
  "Tart lemon, toffee and sweet herb with intense acidity.",
  "Heavy with peanut.",
  "Chocolate, citric acid.",
  "Caramel, sweet lemon, tart cherry, cocoa and raisin with a creamy mouthfeel.",
  "Pulpy and soy nut.",
  "Tart and sweet with pecan brittle, toffee, crisp lime and melon.",
  "Balanced with floral, lemon, toffee and a heavy mouthfeel.",
  "Floral with jasmine, toffee and tart citric acidity.",
  "Sweet floral, toffee, lemon and savory.",
  "Toffee, lemon, chocolate and peanut butter.",
  "Sweet, clean and citric with toffee.",
  "Toffee, lemon, nutty and citric.",
  "Tart acidity with chocolate, clean coffee cherry, savory fruit and a heavy mouthfeel.",
  "Caramel, pecan, orange and almond.",
  "Sugar, caramel, lemon- lime and tart acidity.",
  "Toffee, chocolate, sweet and tart.",
  "Caramel, tart lemon lime, and grapefruit.",
  "Very nice aroma and acidity, juicy, slight nut.",
  "Toffee, lemon and graham.",
  "Toffee, chocolate, lemon and nutty.",
  "Rich, burnt sugar, cola, cane juice, raisin, grapefruit and tangy acidity.",
  "Grapefruit pith and nutty.",
  "Lemon and sweet cedar with a heavy mouthfeel.",
  "Cashew and cedar.",
  "Molasses, black tea, stone fruit, syrupy.",
  "Tangy, lime and raisin.",
  "Winey fruit, berry, tart citric and acetic acidity and nut.",
  "Toffee, cocoa and tart fruit.",
  "dark chocolate, sweet, round body, soft acidity, almonds, deep, winey, sweet, caramel notes",
  "Sweet and creamy with pungent flavor and complex citric, tartaric acidity.",
  "Complex, grape, blackcurrant",
  "Sweet with tart lemon and peanut butter.",
  "Heavy, chocolate, toffee and savory.",
  "smooth, nutty and cocoa.",
  "Cocoa and lime flavors with sweet, nutty aftertaste.",
  "floral, citric acidity, tea-like, milk chocolate, interesting finish",
  "Citric and nutty.",
  "Citric with herbal and earthy flavors.",
  "Nut brittle, chocolate and lemon.",
  "Heavy with lemon and nut.",
  "Heavy with pulp.",
  "Chocolate, winey berry, plum and sugary with intense citric and tartaric acidity.",
  "Rich dark chocolate, caramel, lime and fig with citric and tartaric acidity.",
  "Herbal, toffee, lemon, floral and heavy.",
  "Floral, grapefruit, lemon and herbal.",
  "Sweet red grapefruit, toffee, melon and mild.",
  "Stone fruits, hazelnut, grape",
  "Strawberry, dark chocolate, lime, cinnamon",
  "Fruity, lemon, apple, grape, juicy",
  "Sweet, Rich, Clean Lemon",
  "Prune, cherry, raspberry, lemonade",
  "Sugar Cane, Vanilla, Sweet Tea",
  "Cocoa, cherry, sweet",
  "Grape, lime, cherry",
  "Floral, vanilla, cherry",
  "Cherry, fruit punch, sugar cane, balanced",
  "Mellow, caramelly and sweet with lemon and grapefruit flavors.",
  "Milk chocolate, berry, floral and citric.",
  "Tart, floral, savory, cane juice and lime with tangy intense acidity.",
  "Lime zest, floral, lemon and tropical with intense acidity.",
  "Deep and round.Sweet cane sugar. dark chocolate, grape juice, deeply layered, Yellow apple, green grape, plum and melon sweetness",
  "Sugary, intense citrus fruits, jasmine and green grape with tangy acidity.",
  "Sweet Almond honey light Coco and stone fruit sweet and balanced",
  "Lemon, lime and tomato flavors with smooth mouthfeel.",
  "smooth body, berry, clean, consistent, pleasant aftertaste, cedar, malt and tea-like notes",
  "Toffee, lemon, lavender and smooth.",
  "Lemon, toffee, sweet, clean and herbal.",
  "Tropical, chocolate, cherry and vanilla with a creamy mouthfeel and complex fruit acidity.",
  "Cherry, raisin, clean coffee cherry and tart acidity.",
  "Sweet herb, apple skin and nut with tart acidity.",
  "Nutty and citric.",
  "Creamy with candied lemon, caramel and floral.",
  "Creamy with toffee, chocolate and orange blossom.",
  "Jammy cascara, floral, lime, smooth and intense acidity.",
  "Fruity and floral aroma with tart lemon, sweet nut and citric acidity.",
  "Peanut, lemon and cocoa.",
  "Juicy sweetness, cocoa and lemonade with crisp acidity.",
  "Floral, apricot, caramel, lemon, sweet, clean and delicate.",
  "Simple, toffee, lemon and cashew.",
  "Toffee, grapefruit, floral and chocolate.",
  "Sweet lemon, nutty and herbal.",
  "Earthy, floral, crisp, well balanced cup",
  "Bright cup, lemon-like brightness, honey-drizzled nut. Cocoa and black walnut finish",
  "Bright cup, with fruit and floral notes, lemony zesty",
  "Milk chocolate, Floral, Honey, Apricot",
  "Blueberry, Candylike",
  "Bright cup, floral hints, lingering clean aftertaste",
  "Bright cup, clean fruited and floral hints, moderate body",
  "Low acidity, thick body and rustic flavors",
  "Full body, rich",
  "Earthy, floral and fruity notes",
  "Molasses, almonds, clean cup, some apples notes",
  "Medium acidity, rustic flavors, lingering pleasant aftertaste",
  "Light to medium body, clean cup, bright, floral",
  "Medium body, floral and some chocolate notes, clean cup",
  "Mildly citrusy and bright",
  "Bright, clean fruited notes, floral aromatics",
  "Floral, cacao, earthy, medium to full body, great complexity",
  "Toffee, lemon and savory.",
  "Tart and heavy with toffee, floral and savory flavor.",
  "Sweet and tangy with toffee and tart cherry.",
  "Grapefruit, lime and savory fruits with a lively mouthfeel.",
  "Earthy, floral, medium bodied",
  "Toffee, grapefruit, chocolate and soft.",
  "Toffee, lemon, jasmine, vanilla and tomato.",
  "Intense flavors of apricot, rose, lemon-lime, lavender and chocolate.",
  "Soft, sweet, berry, floral, lemon curd with citric and malic acidity.",
  "Heavy and clean with green grape, chocolate, brown sugar and orange.",
  "Caramel, toffee and lemon-lime.",
  "Caramel, floral, raisin, tomato and tart acidity.",
  "Heavy mouthfeel, with tart lemon.",
  "Creamy, tangy lime, floral and almond toffee.",
  "Toffee, chocolate, pulpy berry, crisp and clean.",
  "Mellow toffee and lemon with a floral and chocolate aftertaste.",
  "Creamy, caramel, toffee, lemon and savory.",
  "Toffee, lemon, nutty, herbal and tart.",
  "Creamy and winey with ripe berry, chocolate and savory flavors.",
  "Sweet,nutty,medium to low acidity with some chocolate notes",
  "Sweet, low in acidity and develops exceptional bittersweet and chocolate taste",
  "Mild cup, medium body, sweetness",
  "Silky body, cane sugar sweetness some floral notes",
  "Savory and citric with nut.",
  "Caramel, nutty, toffee and lemon.",
  "Toffee, lemon and nutty.",
  "Bright cup, well balanced,velvety",
  "Sweet and tart with orange, lemon balm, raisin, caramel and complex acidity.",
  "Heavy, citric and nutty.",
  "Silky body, cane sugar sweetness,floral hints",
  "Berry and butterscotch aromas with sweet pecan, floral, berry, heavy and citric.",
  "Floral aroma with apple, chocolate, tart cherry and lemon; creamy mouthfeel and citric tartaric acidity.",
  "Chocolate, cherry, caramel and berry.",
  "Velvety aftertaste, floral",
  "Floral and fruit notes, bright",
  "Bright cup, floral notes, medium bodied cup.",
  "Nicely balanced, sound body, bright acidity, citric, sweet, light choclate and caramel notes",
  "tea-like, fruity, citric, floral, lemon, sweet, great body, very complex, clean",
  "strong cedar notes, consistent, balanced, sweet tobacco, winey, spicy, chocolate",
  "Savory, Caramel Notes, Bright, Clean, Pleasant Earthiness, Consistent, Spicy, Round Body, Very Complex.",
  "Clean, sweet, chocolate notes, soft nutty notes, mild acidity, full body, balanced.",
  "blueberry, chocolate, strawberry, floral, clean, consistent, balanced, bright lemony sweetness",
  "medium body, light to medium acidity, sweet, a hint of dark chocolate, balanced and smooth.",
  "Well balanced acidity, rich body, initial sweetness with slight notes of fruit, bittersweet, dark cocoa finish",
  "Spicy aroma, vibrant acidity, well-rounded, rich body",
  "Good body, high acidity, excellent aroma, intense flavor, chocolate notes",
  "good fruity complexity, full body, creamy, dried fruit, spice, berry",
  "heavy berry, lemon, stonefruit, dark chocolate",
  "slight blueberry, sweet notes, dried banana, berry and stonefruit, nuanced florals, excellent body and balance",
  "Vanilla, citrus, lively acidity, rich body, well balanced, tropical fruit, toffee, caramel. Very sweet as it cools.",
  "Sweet and well balanced with bright acidity and hints of honey, vanilla, chocolate and peach.",
  "Spicy, clean, earthy tones, chocolate, sweet, light woody notes.",
  "Cupping characteristics: Clean &amp; sweet aromas, chocolate notes, soft nutty notes, mild acidity, full body, balanced",
  "Hazelnut, Caramel, Dark Chocolate, Red Grape, Light Citrus",
  "Caramel, Honey, Chocolate, Vanilla",
  "Chocolate, nutty flavor with a slightly fruity finish of cherry undertones and hints of vanilla. Balance and smooth aftertaste.",
  "walnut, sweet, peach notes, cocoa, soft cranberry acidity, medium body, balanced",
  "spicy, floral, sweet, full creamy body, well-balanced, complex",
  "Citric, spicy, fruity, complex",
  "very sweet, caramel, smooth buttery body, dark chocolate, some berry notes, clean finish",
  "dark chocolate, pleasantly spicy, balanced acidity, dense body, orange, light grape notes",
  "Red berry notes, caramel, sweet, clean, juicy, complex, buttery, dark chocolate notes.",
  "Swiss chocolate, vanilla, orange creamsicle, piquant acidity, creamy body"
]
